Test integrator/integrator/helper-tool/templates/getNewEventFromICMore

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/07/secext" 
    xmlns:int="urn:crmondemand/ws/integrationevent/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>${headers.soapConnectorProperties.icMoreUsername}</wsse:Username>
                <wsse:Password Type="wsse:PasswordText">${headers.soapConnectorProperties.icMorePassword}</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <int:IntegrationEventWS_GetEvents_Input>
            <int:EventCount>1</int:EventCount>
            <int:QueueName>Credit Line Test Queue</int:QueueName>
        </int:IntegrationEventWS_GetEvents_Input>
    </soapenv:Body>
</soapenv:Envelope>
